const {fetchJson,cmd, tlang,sleep } = require('../lib')

//---------------------------------------------------------------------------

cmd({

            pattern: "hack",

            category: "prank",

            desc: "hacking prank",

            use: ' ',

            filename: __filename,

        },

        async(Void,citel, text) => {

citel.reply("```جاري التهكير👽💗```")

await sleep(1000)

citel.reply("```جاري تحميل بيانات الجهاز \n 0%```")

await sleep(1000)

citel.reply("```جاري سحب صور الضحيه😁😶‍🌫️ \n █ 10%```")

await sleep(1000)

citel.reply("```جاري تنظيم الداتا \n █ █ 20%```")

await sleep(1000)

citel.reply("```جاري سحب فيديوهات 👿\n █ █ █ 30%```")

await sleep(1000)

citel.reply("```تم السحب جاري الاستكمال🦠🔥 \n █ █ █ █ 40%```")

await sleep(1000)

citel.reply("```جاري سحب الموسيقي👿🤸\n █ █ █ █ █ 50%```")

await sleep(1000)

citel.reply("```تم السحب جاري الاستكمال🤭🔥 \n █ █ █ █ █ █ 60%```")

await sleep(1000)

citel.reply("```جاري قراءه الملفات المخفيه \n █ █ █ █ █ █ █ 70%```")

await sleep(1000)

citel.reply("```تم سحب الملفات المخفيه 🤸🔥 \n █ █ █ █ █ █ █ █ 80%```")

await sleep(1000)

citel.reply("```جاري سحب شاتات الواتساب \n █ █ █ █ █ █ █ █ █ 90%```")

await sleep(1000)

citel.reply("```تم السحب بنجاح \n █ █ █ █ █ █ █ █ █ █ 100%```")

await sleep(1000)

citel.reply("```النظام يقوم بالانصال بالسيرفرs.. \n جاري الاتصال ```")

await sleep(1000)

citel.reply("```تم الاتصال بنجاح😁... \n جاري تنظيم الداتا...```")

await sleep(1000)

citel.reply("``تم الاختراق بنجاح👿🤸 \n جهز طيزك لعمك وزيرى هينيكك🤭...```")

await sleep(1000)

citel.reply("``` تمت المهمه بنجاح ✅ ```")

await sleep(1000)

citel.reply("``` صلي عالنبي ونت معدي💗...```")

await sleep(1000)

citel.reply("``` استغفر ربك بردو💗```")

await sleep(1000)

            return citel.reply('*تم سحب جميع ملفات جهاز الضحيه بنجاح✅*');

        }

    )
